In [15]:
import pandas as pd

In [16]:
lb = pd.read_csv('../data/uncleaned/labour_force.csv')
lb

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,PRT,LF,MEN,THND_PER,A,1960,2791.0000,NaN
1,PRT,LF,MEN,THND_PER,A,1974,2259.0000,NaN
2,PRT,LF,MEN,THND_PER,A,1975,2378.0000,NaN
3,PRT,LF,MEN,THND_PER,A,1976,2481.0000,NaN
4,PRT,LF,MEN,THND_PER,A,1977,2477.0000,NaN
...,...,...,...,...,...,...,...,...
33709,CRI,LF,WOMEN,THND_PER,Q,2021-Q4,971.8795,NaN
33710,CRI,LF,WOMEN,THND_PER,Q,2022-Q1,985.6447,NaN
33711,CRI,LF,WOMEN,THND_PER,Q,2022-Q2,979.6906,NaN
33712,CRI,LF,WOMEN,THND_PER,Q,2022-Q3,996.8923,NaN
33713,CRI,LF,WOMEN,THND_PER,Q,2022-Q4,993.3235,NaN

In [17]:
for col in lb.keys():
    lb[col]
    print(col,lb[col].isnull().values.any())

LOCATION False
INDICATOR False
SUBJECT False
MEASURE False
FREQUENCY False
TIME False
Value False
Flag Codes True

In [18]:
lb.nunique()

LOCATION         45
INDICATOR         1
SUBJECT           3
MEASURE           1
FREQUENCY         3
TIME           1158
Value         31586
Flag Codes        2
dtype: int64

In [19]:
group = lb[(lb['FREQUENCY']=='A')]
print(group.shape)
group = group[group['SUBJECT']=='TOT']
print(group.shape)
# group = group.groupby(by=['location','time']).sum()

(5665, 8)
(1993, 8)

In [20]:
group

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
1734,MEX,LF,TOT,THND_PER,A,2005,43631.500,NaN
1735,MEX,LF,TOT,THND_PER,A,2006,44982.520,NaN
1736,MEX,LF,TOT,THND_PER,A,2007,45904.540,NaN
1737,MEX,LF,TOT,THND_PER,A,2008,46769.210,NaN
1738,MEX,LF,TOT,THND_PER,A,2009,48018.360,NaN
...,...,...,...,...,...,...,...,...
33547,CRI,LF,TOT,THND_PER,A,2018,2359.644,NaN
33548,CRI,LF,TOT,THND_PER,A,2019,2464.956,NaN
33549,CRI,LF,TOT,THND_PER,A,2020,2406.532,NaN
33550,CRI,LF,TOT,THND_PER,A,2021,2440.771,NaN
33551,CRI,LF,TOT,THND_PER,A,2022,2454.023,NaN

In [21]:
# group.to_csv("./group.csv")

In [22]:
# group = pd.read_csv("./group.csv")
# group

In [23]:
min_year = 2001
# int(group['time'].min())
max_year = int(group['TIME'].max())
sorted_cont = group['LOCATION'].unique()
sorted_cont.sort()
for cont in sorted_cont:
    years = []
    for y in range(min_year,max_year):
#         print(group[group['location']==cont]['time'].astype("string"))
        if (str(y) not in group[group['LOCATION']==cont]['TIME'].astype("string").values):
            years.append(y)
    if len(years)!=0:
        print(cont, years)
#         print(cont,y,group[group['location']==cont]['time'])

BRA [2001, 2002, 2015, 2016, 2017, 2018, 2019, 2020, 2021]
CHE [2001, 2002, 2003, 2004]
COL [2001, 2002, 2003, 2004, 2005, 2006]
CRI [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010]
IDN [2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021]
LTU [2001, 2002, 2003, 2004]
MEX [2001, 2002, 2003, 2004]
OECD [2001, 2002, 2003, 2004, 2005, 2006]
TUR [2001, 2002, 2003, 2004, 2005]

In [24]:
group.drop(['INDICATOR','SUBJECT','MEASURE','FREQUENCY','Flag Codes'],axis=1,errors='ignore')

      LOCATION  TIME      Value
1734       MEX  2005  43631.500
1735       MEX  2006  44982.520
1736       MEX  2007  45904.540
1737       MEX  2008  46769.210
1738       MEX  2009  48018.360
...        ...   ...        ...
33547      CRI  2018   2359.644
33548      CRI  2019   2464.956
33549      CRI  2020   2406.532
33550      CRI  2021   2440.771
33551      CRI  2022   2454.023

[1993 rows x 3 columns]